# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

# CLI utilities
# Note: This replaces some (outdated) built-in macOS utilities with the GNU equivalents
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl", args: ["with-nghttp2"]
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "git"
brew "grep"
brew "gnu-sed", args: ["default-names"] # Install GNU `sed`, overwriting the built-in `sed`
#brew "moreutils" # Install more useful GNU utilities like `sponge`
#brew "openssh"
# brew "pv" # http://www.ivarch.com/programs/pv.shtml
brew "pwgen"
# brew "ripgrep" # https://github.com/BurntSushi/ripgrep
brew "rsync"
brew "screen"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "wget"
brew "ack"
brew "findutils"
brew "gnu-tar"
brew "zsh-completions"
brew "scala"
brew "sbt"
brew "maven"
brew "zinc"
brew "poppler"

# Other useful tools
brew "highlight" # https://developer.atlassian.com/blog/2015/08/beautiful-presentations-with-highlight/
brew "multimarkdown"
brew "pandoc"
brew "reattach-to-user-namespace" # https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard
# brew "xmlstarlet" # http://xmlstar.sourceforge.net/

# Image tools
brew "ffmpeg", args: ["with-libvpx", "with-webp", "with-x265"]
brew "graphicsmagick"
brew "imagemagick", args: ["with-librsvg", "with-webp"]

# Compression tools
brew "bzip2"
brew "gzip"

# Mac OS tools
brew "duti" # Required for setting preferences (https://github.com/moretension/duti/)
brew "imagesnap"
brew "tccutil" # Required for setting preferences
brew "trash"
brew "wifi-password"

# Server stack
brew "dnsmasq"
brew "percona-server"

# Programming languages
# Installing Python/Ruby with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "go"
brew "python"
brew "pyenv" # Python
brew "ruby-build"
brew "rbenv" # Ruby
brew "nvm"
# brew "node" # Also installs `npm`
brew "yarn" # Faster than npm

# Network tools
brew "namebench"
brew "nmap"
brew "speedtest_cli"

# Security tools
# brew "foremost"
# brew "justwatchcom/gopass/gopass"
# brew "hashpump"
brew "sqlmap"

# Install GUI applications
# cask "adapter"
# cask "adobe-creative-cloud"
# cask "airdisplay"
# cask "airserver"
cask "atom"
# cask "bartender"
# cask "boom"
# cask "colors"
cask "dropbox"
# cask "flux"
# cask "forklift" # version 3 is paid, version 2 on Mac App Store is free. Transmit alternative.
# cask "imagealpha"
# cask "imageoptim"
cask "iterm2"
# cask "itsycal"
# cask "kaleidoscope"
# cask "password-assistant"
# cask "sequel-pro"
# cask "slack"
cask "sublime-text"
# cask "the-unarchiver"
# cask "transmission"
# cask "vector-magic"
cask "vlc"
cask "wkhtmltopdf"

cask "alfred"
cask "charles"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "iterm2"
cask "etcher"
cask "postman"
cask "sublime-text"
cask "tunnelblick"
cask "evernote"


# Browsers
# cask "safari-technology-preview"
# cask "webkit-nightly"
cask "google-chrome"
# cask "google-chrome-canary"
# cask "opera"
# cask "opera-beta"
cask "firefox"
# cask "firefoxnightly"

# Virtulization applications
# cask "vmware-fusion"
# cask "vagrant"
# cask "vagrant-manager"

# Preference Panes
cask "hosts"

# Screensavers
# cask "ios-saver"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "webpquicklook"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize"

# Color Picker plugins
cask "colorpicker-skalacolor"

# Fonts
cask "font-anonymous-pro"
cask "font-bebas-neue"
cask "font-comic-neue"
cask "font-dejavu-sans"
cask "font-league-gothic"
cask "font-liberation-sans"
cask "font-symbola"

# MAS applications
mas "Marked 2", id: 890031187
mas "Day One", id: 1055511498
mas "Next", id: 896146364
mas "Telegram", id: 747648890
mas "Twitter", id: 409789998
mas "Marked 2", id: 890031187
mas "Pixelmator", id: 407963104
mas "1Password", id: 443987910
mas "Fantastical 2", id: 975937182
mas "ForkLift", id: 412448059
mas "Airmail 2", id: 918858936
mas "Microsoft Remote Desktop", id: 715768417
mas "Guidance", id: 412759995
mas "Slack", id: 803453959

# Apple MAS applications
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Xcode", id: 497799835
